app/controllers/items_controller.rb

  def index
    @item = Item.new
    @items = Item.all
    @ladies = Category.find(1)
    @ladies_grandchild = @ladies.indirects
    @men = Category.find(219)
---
SELECT `items`.* FROM `items` ORDER BY created_at DESC
SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 219 LIMIT 1